app/controllers/carts_controller.rb

    def index
        if params[:query].present?
            @products = Product.where("name LIKE ?", "%#{params[:query]}%")
        else
            @products = Product.all
---
SELECT `products`.* FROM `products` WHERE (name LIKE '%product11%')
SELECT `products`.* FROM `products`

    def all
        @carts = Cart.includes(:product).all
        @total_price = 0
        @total_quantity = 0

        @carts.each do |cart|
---
SELECT `carts`.* FROM `carts`
SELECT `products`.* FROM `products` WHERE `products`.`id` IN (7, 6)

    def create
        @cart = Cart.new(product_id: params[:product_id], quantity: params[:quantity])

        if @cart.save
---
INSERT INTO `carts` (`product_id`, `quantity`, `created_at`, `updated_at`) VALUES (6, 2, '2024-02-10 19:46:38.187767', '2024-02-10 19:46:38.187767')

    def destroy
      @cart.destroy
---
DELETE FROM `carts` WHERE `carts`.`id` = 12

      def set_cart
        @cart = Cart.find(params[:id])
---
SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 12 LIMIT 1

      def get_total
        @total_count=Cart.count
---
SELECT COUNT(*) FROM `carts`