app/controllers/products_controller.rb

    def destroy
        @product.destroy
---
DELETE FROM `products` WHERE `products`.`id` = 18

    def create
        @product = Product.new(product_params)

        if @product.save
---
INSERT INTO `products` (`name`, `description`, `price`, `created_at`, `updated_at`) VALUES ('product 11', 'description 11', 110000, '2024-02-10 19:37:31.989134', '2024-02-10 19:37:31.989134')

    def edit
        @products = Product.all
---
SELECT `products`.* FROM `products`

    def update
        if @product.update(product_edit_params)
---
UPDATE `products` SET `products`.`description` = 'description edit 11', `products`.`updated_at` = '2024-02-10 19:44:01.391511' WHERE `products`.`id` = 18

    def get_total
        @total_count=Cart.count
---
SELECT COUNT(*) FROM `carts`